---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue
source: html/78899047-3d71-df61-6c94-43980988a366.htm
---
# ElectricalDemandFactorValue Methods

Sets the max range on the value to unlimited